{
  "head": {
    "title": "COVID-19 Spread Visualizer",
    "subtitle": "Mapping the spread of the COVID-19 infectious virus.",
    "date": 1585014632,
    "link": "covid-19-coronavirus-d3-leaflet-visualizer",
    "description": "COVID-19, the infection currently stunting the global economy and culture, can easily be visualized and understood with the Leaflet mapping tool and D3.js",
    "image": "image/generic/virus.jpg",
    "tags": [
      "node", "d3", "leaflet", "react", "covid-19", "coronavirus", "javascript"
    ]
  },
  "contents": [
    {
      "type": "p",
      "contents": "Wow. The world is really freaking out over this. I barely had time to catch my breath after coming back from a trip from Oahu, Hawaii, when all of a sudden, everything around me was shutting down."
    },
    {
      "type": "p",
      "contents": "So in an effort to stay informed, I quickly created a visualizer to view just how quickly the virus is spreading. I don't have much to say about it now as I am not a medical professional and I don't have all the answer."
    },
    {
      "type": "p",
      "contents": "What I do have is my skills and a dataset. So for now, I hope you can get a better understanding of the spread of the virus by examining the dataset directly. Please, let me know what else I can provide."
    },
    {
      "type": "table",
      "props": {
        "headings": [
          "Links"
        ]
      },
      "contents": [
        {
          "type": "a",
          "props": {
            "target": "tab",
            "href": "https://github.com/CSSEGISandData/COVID-19/tree/master/csse_covid_19_data/csse_covid_19_time_series"
          },
          "contents": "CDC Dataset (Updated Daily)"
        },
        {
          "type": "a",
          "props": {
            "target": "tab",
            "href": "https://github.com/jackmead515/blog/tree/master/covid-vis/src"
          },
          "contents": "Source Code"
        },
        {
          "type": "a",
          "props": {
            "target": "tab",
            "href": "/plugin/covid19"
          },
          "contents": "Fullscreen COVID-19 Map"
        }
      ]
    },
    {
      "type": "p",
      "contents": "Whatever you make of this data, please, listen to the professionals in the medical field. They are the ones who will know the best how this event will play out."
    },
    {
      "type": "p",
      "contents": "For now, stay safe. Wash your hands. Don't touch your face. And if you are infected, seek out medical help immediately."
    },
    {
      "type": "p",
      "contents": "NOTE: if all you see if a black screen that's probably because the map provider I am using is a paid service. I'll see how I can fix that soon."
    },
    {
      "type": "plugin",
      "props": {
        "source": "plugin/covid19",
        "id": "covid19",
        "width": "100%",
        "height": "600"
      }
    }
  ]
}