{
  "head": {
    "title": "DHT11 Driver in Rust",
    "subtitle": "Reading a DHT11 temperature and humidity sensor in Rust",
    "date": 1578174724,
    "link": "dht11-temperature-humidity-rust-driver-raspberry-pi",
    "description": "The DHT11 sensor can read temperature and humidity at a high accuracy. Learn how to create a simple driver for it in Rust for the Raspberry Pi!",
    "image": "image/generic/raspberry-pi.jpg",
    "tags": [
      "rust", "embedded", "raspberry", "pi", "arduino", "dht11", "python", "sensor", "electronics", "programming"
    ]
  },
  "contents": [
    {
      "type": "p",
      "contents": "If there is one thing I like, it's getting electronics on the cheap. The most generic, versatile, cheap, and avaliable temperature and humidity sensor on the market is the DHT11."
    },
    {
      "type": "p",
      "contents": "This sensors comes with a ±2℃ temperature accuracy and a ±5% relative humidity accuracy. WOW! All for like $2.00 per sensor. That's awesome."
    },
    {
      "type": "p",
      "contents": "However, what I really don't like is how the Raspberry Pi community is obsessed with Python as it's go to programming language of choice. While Python is really easy to read and write, it's slow. Now people will really argue with me on this, but, ultimately, to ensure exact precious in timing and safety with memory, a system's level programming language is better used."
    },
    {
      "type": "p",
      "contents": "Going one step further, C or C++ is the obvious choice. However, I'm going to use a relatively new programming language: Rust."
    },
    {
      "type": "p",
      "contents": "Rust is an open sourced systems level programming language that is just as fast as C or C++ (sometimes) but uses an ownership based memory mangagment system to ensure safety from overloads and leaks."
    },
    {
      "type": "p",
      "contents": "And, I think that it's pretty easy to read. At least, I'm going to write a driver that's easy to read."
    },
    {
      "type": "p",
      "contents": "Alright, enough jib jab. Here are some resources including the DHT11 datasheet, Adafruit's Python/C implementation, and the full source code."
    },
    {
      "type": "a",
      "props": {
        "target": "tab",
        "href": "https://www.mouser.com/datasheet/2/758/DHT11-Technical-Data-Sheet-Translated-Version-1143054.pdf"
      },
      "contents": "DHT11 Mouser Datasheet"
    },
    {
      "type": "a",
      "props": {
        "target": "tab",
        "href": "https://github.com/adafruit/Adafruit_Python_DHT"
      },
      "contents": "Adafruit DHT Github"
    },
    {
      "type": "a",
      "props": {
        "target": "tab",
        "href": "https://github.com/jackmead515/rust_dht11"
      },
      "contents": "Full Driver Source Code"
    },
    {
      "type": "a",
      "props": {
        "target": "tab",
        "href": "https://pinout.xyz/"
      },
      "contents": "Raspberry Pi GPIO Pinout"
    },
    {
      "type": "p",
      "contents": "Let's start by looking at the datasheet. I'll use the sections in the datasheet and explain them one by one."
    },
    {
      "type": "p",
      "contents": "Section 5.0 describes the total amount of data that should be recieved. One cycle of reading should be 40 bits total and be the sequence of 8 bits humidity data, 8 bits humidity decimal, 8 bits temperature data, 8 bits temperature decimal, and then 8 bits containing a checksum value. It then states that the checksum value should be equal to the 4 previous values combined. Great!"
    },
    {
      "type": "p",
      "contents": "Section 5.1, 5.2, and 5.3 describes the communication process. First thing we have to do is pull the DHT11 data pin high then keep it low for at least 18ms. Then, pull it high and wait 20 to 40 microseconds for the sensor to recieve the pullup and start a transmission. Next, the sensor will pull low for 80 microseconds, then high for 80 microseconds. After this, we are ready to start reading the bits from the sensor."
    },
    {
      "type": "p",
      "contents": "The data is transmitted by a series of high and low signals always starting low for 50 microseconds. After the low signal, it will pull high for a time. If the time is between 26 to 28 microseconds, the bit is 0. If the time is 70 microseconds, the bit is 1."
    },
    {
      "type": "p",
      "contents": "If the data signal is held high for too long though, the datasheet says that a communication issue has a occured and you might need to check the connections or try again."
    },
    {
      "type": "p",
      "contents": "The last bit will end with a 50 microsecond low voltage signal. After this, we should have all of our data! So let's take a breath and try to visualize the data transmission."
    },
    {
      "type": "image",
      "props": {
        "source": "image/dht11/data_transfer2.jpg"
      }
    },
    {
      "type": "p",
      "contents": "It looks like the first part, where we transition from high to low, will be us programmically turning the gpio from high to low. The rest is left up to the sensor. So let's start with some code comments of the things we need to do."
    },
    {
      "type": "code",
      "props": {
        "language": "rust",
        "source": "// Set HIGH-LOW-HIGH start signal\n\n// For 40 bits, capture the pulses from the sensor\n\n// Compute the temperature, humidity, and checksum\n\n// Validate that the data is valid from the checksum"
      }
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "So let's start with the first step (of course). There is a great cargo library in Rust called <b>rppal</b>. This is an awesome library we can use for communicating with the Raspberry Pi's GPIO bus. I won't try to reimplement a GPIO pin. That would take too much time. Further, I am going to use a wrapper struct called <b>GPIOPin</b>. This will make it just that much easier to work with the bus."
    },
    {
      "type": "code",
      "props": {
        "language": "rust",
        "source": "// Set HIGH-LOW-HIGH start signal\n\nlet pin = 4; // BCM Numbering\nlet gpio = GPIOPin::new(pin)?;\n\ngpio.set_output();\ngpio.set_high();\nthread::sleep(Duration::from_millis(100));\ngpio.set_low();\nthread::sleep(Duration::from_millis(20));\ngpio.set_high();\nthread::sleep(Duration::from_micros(30));\ngpio.set_input();"
      }
    },
    {
      "type": "p",
      "contents": "Not to bad. Straight forward. Easy to read. I picked an arbitrary amount of milliseconds to set it high initially. You will have to play around with these numbers until the sensors reads it successfully. Now, we need to attempt to read the bits from the sensors"
    },
    {
      "type": "code",
      "props": {
        "language": "rust",
        "source": "// For 40 bits, capture the pulses from the sensor\n\nconst DHT_MAXCOUNT: usize = 32_000;\nconst DHT_PULSES: usize = 41;\nlet mut pulse_counts: [u32; DHT_PULSES*2] = [0; DHT_PULSES*2];\n\nfor i in (0..DHT_PULSES * 2).step_by(2) {\n\twhile self.pin.is_low() {\n\t\tpulse_counts[i] += 1;\n\t\tif pulse_counts[i] >= DHT_MAXCOUNT as u32 {\n\t\t\treturn Err(SensorError::Timeout(\"timed out low pulse capture\".to_string()));\n\t\t}\n\t}\n\twhile self.pin.is_high() {\n\t\tpulse_counts[i + 1] += 1;\n\t\tif pulse_counts[i + 1] >= DHT_MAXCOUNT as u32 {\n\t\t\treturn Err(SensorError::Timeout(\"timed out high pulse capture\".to_string()));\n\t\t}\n\t}\n}"
      }
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "Alright. So, what's going on here? Well to start, the <b>DHT_MAXCOUNT</b> is a value that's going to be dependent on the platform you are running. I found that 32k works pretty nicely on the Raspberry Pi 3B. As you can see, while the pulses are oscillating back and forth, there is a potential for it to 'timeout'. How long does it take to timeout is the question. Generally, if you find a higher value to be more reliable, choose that one!"
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "Next, the <b>DHT_PULSES</b> is the amount of pulses the sensor will give off: 40 bits! You'll see why we add one in a moment. The next variable <b>pulse_counts</b> is our array that we will use to record the low and high which should be 80 transistions total."
    },
    {
      "type": "p",
      "contents": "So in this for loop, we will record the low pulses in the even indicies and the high pulses in the odd indicies. The low pulses should be the same (around 50 microseconds, whatever that equals out to on our platform). The high pulses on the other hand should vary a lot more. We should get a higher value for a 1 and a lower value for 0. If we get a print out of the array at this point, we get something like below."
    },
    {
      "type": "code",
      "props": {
        "language": "rust",
        "source": "println!(\"{:?}\", &pulse_counts[..]);\n\n[0, 125, 85, 37, 88, 38, 87, 113, 87, 87, 54, 113, 87, 38, 88, 37, 89, 113, 88, 39, 87, 38, 88, 38, 87, 39, 88, 37, 88, 38, 87, 38, 89, 38, 89, 38, 87, 38, 88, 39, 87, 113, 87, 38, 88, 112, 88, 112, 88, 39, 88, 38, 87, 38, 89, 37, 88, 38, 87, 38, 89, 112, 88, 38, 87, 115, 87, 38, 87, 113, 87, 38, 88, 112, 88, 38, 87, 113, 87, 38, 89, 38]"
      }
    },
    {
      "type": "p",
      "contents": "As you can see, we do see a pattern going on. We see a value range of 85-89, followed by a value at 39 or around 113. Looks like we are doing something right! So let's try to decode this data."
    },
    {
      "type": "p",
      "contents": "First we need a reliable number to be able to differentiate between a 0 and a 1. Now, knowing our value range, we have a data transfer that goes high between 26us and 70us and then low for 50us. I think that the average value of the lows should do nicely since it should be in the middle of the value range!"
    },
    {
      "type": "code",
      "props": {
        "language": "rust",
        "source": "// Compute the temperature, humidity, and checksum\n\nlet mut threshold = 0;\nfor i in (2..DHT_PULSES * 2).step_by(2) {\n\tthreshold += pulse_counts[i];\n}\nthreshold /= DHT_PULSES as u32 - 1;"
      }
    },
    {
      "type": "p",
      "contents": "Starting with the first even index, and skipping to every following even index, we are targeting the low pulses (those values around 85-89). Then, we divide by the total amount of low pulses there should be. Basically, we just calculated the average of the low pulses! Wicked cool!!"
    },
    {
      "type": "p",
      "contents": "Now, let's do some bit manipulation and calculate exactly what the sensor was trying to give us."
    },
    {
      "type": "code",
      "props": {
        "language": "rust",
        "source": "// Compute the temperature, humidity, and checksum\n\nlet mut data: [u8; 5] = [0; 5];\nfor i in (3..DHT_PULSES * 2).step_by(2) {\n\tlet index = (i - 3) / 16;\n\tdata[index] <<= 1;\n\tif pulse_counts[i] >= threshold {\n\t\tdata[index] |= 1;\n\t}\n}"
      }
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "Alright let's take this slowly... our <b>data</b> variable is an array of u8 numbers (8 bit numbers) and length 5 according to the datasheet. First we need to target the odd variables. So we start at index 3 and skip 2 after that. Easy enough. However, what is this <b>index</b> variable? This is just a smart way of computing the index we are targeting in the data array from the pulse_counts array. Since <b>5 * 16 = 40</b>, we know that as we scan across the pulse_counts array, we will insert 8 bits into the same index."
    },
    {
      "type": "p",
      "contents": "Now that we know our index, we perform a left shift on the data point in the index. A left shift will move all bits in the value to the left! Finally, we provide an if statement saying that if our current bit in the pulse_counts array is above the threshold, use the | operator to insert a 1 on the right. Okay. Let's see what the heck is going on."
    },
    {
      "type": "code",
      "props": {
        "language": "rust",
        "source": "// First 8 bits are at index 0;\nindex = 0\n\n// Data at that index is an 8 bit integer\ndata[index] = [00000000]\n\n// If our pulse_counts variable has a sequence of...\npulses = [38, 38, 113, 113, 38, 113, 113, 38]\nthreshold = 89\n\n// Then here is what the first 8 loops will look like:\ndata[0] = [00000000]\ndata[0] = [00000000]\ndata[0] = [00000001]\ndata[0] = [00000011]\ndata[0] = [00000110]\ndata[0] = [00001101]\ndata[0] = [00011011]\ndata[0] = [00110110]\n\n// That binary value to decimal is...\ndata[0] = 54"
      }
    },
    {
      "type": "p",
      "contents": "Hopefully you can see how the bits are shifted, and then a value is inserted if needed according to whether or not the pulse count value was above the threshold. (This took me a long time to figure out myself. Don't be afraid to ask questions or explore more about the how the bits are shifting)."
    },
    {
      "type": "p",
      "contents": "Alright, without further ado, we can validate the checksum and calculate the values! This step is much easier. Let's just see the code."
    },
    {
      "type": "code",
      "props": {
        "language": "rust",
        "source": "if data[4] == data[0] + data[1] + data[2] + data[3] {\n\tlet hint = data[0] as f32; let hdec = data[1] as f32;\n\tlet tint = data[2] as f32; let tdec = data[3] as f32;\n\tlet temp: f32 = tint + (tdec / 10.0);\n\tlet humid: f32 = hint + (hdec / 10.0);\n\n\treturn Ok((temp, humid));\n} else {\n\treturn Err(SensorError::FailedRead(\"failed checksum validation\".to_string()));\n}"
      }
    },
    {
      "type": "p",
      "contents": "First we test if the checksum is equal to all the other values added up. If it is, we have our data successfully! Otherwise, we return an Err as the data we have is somehow corrupted. If we have successful data, then we pull out the individual parts."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "<b>tint</b> describes the integer component of the reading, while <b>tdec</b> describes the decimal component. Seeing as how that accuracy is to the tenths place, it's just a simple conversion to get the final results <b>temp</b> and <b>humid</b>. And with that, your done!"
    },
    {
      "type": "p",
      "contents": "Now, your probably wondering, how can I quickly check if what your saying is right and test it out for myself? Fair question. So below I'll explain the steps to take to install Rust on a Raspberry Pi, install the sensor, and get going. (I'll be assuming you know a fair amount about linux and programming since you made it through this entire post)."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "<b>Step 1.)</b><br/>Get a Raspberry Pi. It would be preferable to get a Raspberry Pi 3B or greater as it has a wifi chip."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "<b>Step 2.)</b><br/>Install the Raspbian OS. It's fairly easy to do and there are plenty of resources out there to help you. In fact, your Pi probably already comes with a SD card with the OS preloaded."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "<b>Step 3.)</b><br/>Enable SSH so you can remote it. If you'd prefer to not do that, plug in a keyboard, mouse and monitor!"
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "<b>Step 4.)</b><br/>Plugin a DHT11 into BCM GPIO pin 4. Then, plug VCC into 5V and GND to GND. Use the link above to help you figure out the pin numberings."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "<b>Step 5.)</b><br/>Open a terminal and install Rust by typing the following."
    },
    {
      "type": "code",
      "props": {
        "language": "shell",
        "source": "curl https://sh.rustup.rs -sSf | sh"
      }
    },
    {
      "type": "p",
      "contents": "The Rustup installer should give you a few dialog boxes. Go ahead a choose the obvious. The Rustup installer is pretty smart and automatically detects your current hardware configurations."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "<b>Step 6.)</b><br/>Install git and clone the DHT11 Rust driver repository. Type in the below."
    },
    {
      "type": "code",
      "props": {
        "language": "shell",
        "source": "sudo apt-get install git -y && git clone https://github.com/jackmead515/rust_dht11"
      }
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "<b>Step 7.)</b><br/>Build the library, run it, and have fun!"
    },
    {
      "type": "code",
      "props": {
        "language": "shell",
        "source": "cd rust_dht11\ncargo build\nsudo ./target/debug/rust_dht11"
      }
    },
    {
      "type": "p",
      "contents": "If you have any questions or suggestions, don't be afraid to comment below! Thank you!"
    }
  ]
}