{
  "head": {
    "title": "D3 Live Updating Graphs",
    "subtitle": "Building D3 graphs for live update feeds",
    "date": 1579550947,
    "link": "d3-live-updating-graph",
    "description": "Everyone can make a line graph really easily with D3.js. But updating a graph for a live feed is another story. Learn how you can make live updating graphs with D3!",
    "image": "image/generic/code2.jpg",
    "markdown": true,
    "tags": [
      "javascript",
      "node",
      "d3.js",
      "graph",
      "react",
      "programming"
    ]
  },
  "contents": "<p>Alright this will be a short one. But an informative one. It's pretty easy to l\nook up a quick tutorial for how to create a line graph with D3.js. But what \nabout a line graph that can accept new data as a live feed? Well, quick and dirty, \ncheck out the source code below for your copy pasta work.</p>\n<p><a href=\"https://github.com/jackmead515/blog/blob/master/plugins/d3-graphs/src/LiveUpdating.js#L15\" rel=\"noopener noreferrer\" target=\"_blank\">Github Source Code</a></p>\n<p>The prinicpals of it are extremely simple but may not be obvious to those that haven't seen it yet! Once you get the hang out it, you will be able to create dynamic ever-changing visualizations like the one just below. The visualization below is a automatically updating graph that translates a virtual sensor (configurable from your mouse) to data on the line graph.</p>\n<iframe id=\"capacitor-sensor\" width=\"100%\" height=\"400\" src=\"/plugin/capacitor-sensor\">\n</iframe>\n<p>So let's start with the basics. Let's target a div element by it's ID and snatch it's width and height to create D3 scales.</p>\n<pre><code class=\"javascript language-javascript\">const bb = d3.select('#graph').node().getBoundingClientRect();\n\nconst xScale = d3.scaleLinear()\n  .domain([0, 100])\n  .range([0, bb.width]);\n\nconst yScale = d3.scaleLinear()\n  .domain([0, 10])\n  .range([bb.height, 0]);\n</code></pre>\n<p>Very straight forward. The getBoundingClientRect() is a neat little trick. It's not specific to D3 either. You can use the function after calling node() on any HTMLDocument.</p>\n<p>Alright next we will create our fake data, render an SVG, create our line, and apply the data to it as a path!</p>\n<pre><code class=\"javascript language-javascript\">const data = new Array(100)\n  .fill(0)\n  .map(() =&gt; Math.random()*10);\n\nconst svg = d3.select('#graph')\n  .append('svg')\n  .attr('id', 'svg')\n  .attr('width', '100%')\n  .attr('height', '100%');\n\nconst line = d3.line()\n  .curve(d3.curveBasis)\n  .x((_, i) =&gt; xScale(i))\n  .y((d) =&gt; yScale(d))\n\nsvg.append('path').attr('d', line(data))\n</code></pre>\n<p>Couple notes to remember is that we are applying the xScale and yScale to the data on the d3.line(). If we didn't do this, D3 would interpret it as pixels and we would get a very small graph. The next note is that we apply a path to the svg element and call 'd' to apply our line function too it. The line function will return data for our path element!</p>\n<p>Now. That's easy. But here is the entertaining part. For simulation purposes, I am creating an interval in javascript and then generating new data every loop. Then, to apply the data, we use D3 functions to select all the path elements under the svg and call the data function on them to apply our updated data. Finally, we regenerate our line graph using the same line function.</p>\n<pre><code class=\"javascript language-javascript\">this.interval = setInterval(() =&gt; {\n  data.pop();\n  data.unshift(Math.random()*10);\n\n  svg.selectAll('path')\n    .data([data])\n    .attr('d', line);\n}, 50);\n</code></pre>\n<p>You see? Not bad when you see a demonstrated easy to read blog post about it. Hope you enjoyed that. Thank you all and good day. Leave any questions you have in the comments below!</p>\n<iframe id=\"/d3-graphs\" width=\"100%\" height=\"200\" src=\"/plugin//d3-graphs\">\n</iframe>"
}