{
  "head": {
    "title": "Lost in the Mountains of Colorado",
    "subtitle": "Getting sick, lost, and stranded in the Rocky Mountain foothills",
    "date": 1572022800,
    "link": "lost-in-colorado",
    "image": "image/generic/mountain.jpg",
    "markdown": true,
    "tags": [
      "travel",
      "colorado"
    ]
  },
  "contents": "<p>Colorado is a very odd state. Half, vast plains of shrubbery dotted with dairy cow fields, the other, desert-like mountains standing dead quiet. Some of it crowded with people and culture and some covered in lonely forests whose brush cracks beneath your feet.</p>\n<p>No matter how busy it can get, even during the height of Memorial Day weekend (a camping tradition for people in the United States), it seems as though there is always a quiet nook somewhere around another winding dirt road.</p>\n<p>As fate always has it, my partner and I found ourselves quite in the middle of nowhere. To be specific, you can find it here…</p>\n<p><a href=\"https://www.google.com/maps/place/39%C2%B014'29.3%22N+105%C2%B042'40.6%22W/@39.2414831,-105.713481,723m/data=!3m1!1e3!4m5!3m4!1s0x0:0x0!8m2!3d39.241479!4d-105.711287\" alt=\"google maps\">\n    Middle of no where\n</a></p>\n<p>However, the exact seclusion of this spot was intentional. We severely needed a break from city noises, cell phones, and emails. This location was more than what we bargained for. In fact, we hadn't even bargained for it at all.</p>\n<p>HipCamp is a service that, like Airbnb, allows people to rent out their properties. But, with this service, people rent out there properties for backyard camping. We had just discovered this website a few weeks before after I had discovered that every popular national campground was booked completely full for Memorial Day weekend. I was ecstatic about it. I was going to be able to find a truly private backyard on a ranch somewhere far away from everyone and everything else. Unfortunately, it didn't occur to me that people could easily claim they owned a piece of property and collect their money before we had even arrived. (Or at least we thought that's what happened)</p>\n<p>Three hours into a system of winding roads, ears popping, and tunes dropping, we found ourselves at the coordinates that were provided to us for a campsite near a small pond. Two thing was missing, however: any sort of pond or campsite. I looked on google maps after returning and discovered no sign of a body of water in the area at all! We had been doped and had a few hours of day light left.</p>\n<p>Fortunately, as any traveler should know, people can and will help you. After a few minutes of looking over our offline maps and attempting to climb hills to get any sort of cell phone signal, a Native American looking man, riding a four-wheeler, with an inviting smile, stopped to help us. He was ecstatic about helping us, offering us multiple places to explore camping, his own property, and even a nice cold beer.</p>\n<p>With much distaste, however, I have to note that I did not capture the site with my camera. It was nearing night, with an hour left of dusk, and neither of us had eaten or relaxed in 15-20 hours. We thought it best to eat and relax first and catch the sunrise the next morning. So, after gathering more firewood, slicing up some vegetables and tofu, and roasting them as kabobs over the fire, we sat back in some chairs with a beer and cigar and chatted until midnight. This is when the true adventure began.</p>\n<h2 id=\"1200pmmidnight\">12:00pm - Midnight</h2>\n<p>We gathered up the rest of the food, put it in the car (as to not attract bears) and climbed into our tent. Nights in the mountains can get quite cold. Seeing as how we were using our sleeping bags as padding from the hard ground, all we had was a thin fleece blanket to snuggle underneath. Through shivers, eery dark quietness, and being awake for ~20 hours, we managed to fall into a deep sleep.</p>\n<h2 id=\"1245am\">12:45am</h2>\n<p>I instantly wake to the sound of my partner, shamefully admitting, she is going to hurl. Within seconds, she climbed over me and climbed out of the tent. As I nervously, half awake, and in the dark, wait quietly, I suddenly hear an excruciating gagging sound from her. At that instant, I can taste the overly spiced kabobs on my tongue. 'It must be the food. I over spiced it.' I say to myself. Secretly, I was just hoping it wasn't altitude sickness. After a lot of pleading, I get her back into the tent and convince her I am just a crappy cook.</p>\n<h2 id=\"100am\">1:00am</h2>\n<p>Once again, I'm instantly awoken to the sounds of gagging. Except, this time, nothing is coming out. It's a dry heave. I can no longer avoid the fact that we are stuck downhill on an ATV only road, at 1:00 o'clock in the morning, 3 hours out of the city, through the winding and twisting turns of the mountain roads, with no cell signal to remember the tens of turns and different road names, with half a tank of gas, and a partner who could potentially be in serious danger at 2878 meters above sea level.</p>\n<p>So I make a very serious decision between two choices that, to put it harshly, could have meant life or death (At the time, I didn't really know much about altitude sickness. So I took it with the upmost seriousness!). I make the obvious one, life, and put myself into superhuman mode. With only the light of the moon, I rip the tent out of the ground and grab the various tools and supplies laying around our campsite to throw them into the back of the car.</p>\n<p>Zipping my way back up the dirt road in the middle of the night, half asleep, I get stuck. With a simple 4-cylinder engine and a frame that barely sits 10 inches off the ground, my vehicle stood little chance against the tight bends and two feet deep trenches. However, I was able to get out of the half-mile road after about an hour of pushing, sweating, and using abusive language.</p>\n<h1 id=\"430am\">4:30am</h1>\n<p>We finally arrive back in Denver where we can physically breathe again. And after asking five different hotels if there are any rooms available, I grit my teeth at the last stop as I pay $400 for a 2-night stay in the last room of a very mediocre hotel.</p>\n<p>At that moment, I realize that it's been 24 hours since I last slept. Debatably, that's not a long time. However, when you've had 4 hours of sleep the night before (driving until 3:00am, sleeping until 7:00am), have been driving, hiking, and running around since waking up, it's understandable that your mind would be a pile of cold oatmeal. So, I completely and utterly pass out from exhaustion and don't wake up until 4 in the afternoon.</p>\n<p>Moral of the story? There really isn't anything that I want you to learn from this other than that no matter where you go in your travels there will always be unexpected consequences. But, these consequences, will be the only thing you remember from your travels. So don't be afraid. It's these moments you want to live for.</p>\n<blockquote>\n  <p>It's a dangerous business, Frodo, going out your door. You step onto the road, and if you don't keep your feet, there's no knowing where you might be swept off to.</p>\n</blockquote>"
}