{
  "head": {
    "title": "MCP3008 ADC Driver in Rust",
    "subtitle": "Reading a MCP3008 chip using the SpiDev package",
    "date": 1578760714,
    "link": "mcp3008-analog-digital-spidev-rust-driver-raspberry-pi",
    "description": "The MCP3008 is a popular chip that can use the SPI protocol to read analog signals. Build a minimal Rust driver for the chip using the SpiDev interface on the Raspberry Pi.",
    "image": "image/generic/electronics.jpg",
    "markdown": true,
    "tags": [
      "rust",
      "embedded",
      "raspberry",
      "pi",
      "arduino",
      "mcp3008",
      "spidev",
      "python",
      "sensor",
      "electronics",
      "programming"
    ]
  },
  "contents": "<p>Upon recieving my first Raspberry Pi, I had hardly any knowledge of electronics. I just wanted to build something cool and there was a lot of buzz going around about this amazing tiny microprocessor.</p>\n<p>Upon understanding more, I grew a little annoyed that I couldn't hook up a simple photoresistor, soil moisture sensor, or any sort of bare bones resistive or capacitive sensor because the Pi can only read digital!!</p>\n<p>And continuing further with my understanding, I learned that it's actually really simple with a few electronic components.</p>\n<p>Since there is a lot of information to be learned in this tutorial, I will provide a list of outside references to learn more about the MCP3008 chip and the other electronics mentioned.</p>\n<p><a href=\"https://github.com/jackmead515/rust_mcp3008\" alt=\"link\">\n    Full Driver Source Code\n</a></p>\n<p><a href=\"https://github.com/adafruit/Adafruit_CircuitPython_MCP3xxx\" alt=\"link\">\n    Adafruit Python Driver Code\n</a></p>\n<p><a href=\"http://ww1.microchip.com/downloads/en/DeviceDoc/21295d.pdf\" alt=\"link\">\n    MCP3008 Datasheet PDF\n</a></p>\n<p><a href=\"https://pinout.xyz/\" alt=\"link\">\n    Raspberry Pi GPIO\n</a></p>\n<p><a href=\"https://www.speblog.org/blog/mcp3008-analog-digital-electronic-circuit-raspberry-pi\" alt=\"link\">\n    MCP3008 Circuit Design Blog\n</a></p>\n<p>Let's start by looking at the datasheet and creating a table of the most important features. I'm providing this as a convience list as everytime I go to hook one of these chips up, I always need reminding of at least one of these stats.</p>\n<table>\n<thead>\n<tr>\n<th style=\"text-align:left;\">Title</th>\n<th style=\"text-align:left;\">Description</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td style=\"text-align:left;\">Operating Voltage</td>\n<td style=\"text-align:left;\">2.7V to 5.5V</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Operating Current</td>\n<td style=\"text-align:left;\">550 micro amps. Super low!!</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Bit Resolution</td>\n<td style=\"text-align:left;\">10 bits, or, a number from 0 to 1023.</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Sampling Rate</td>\n<td style=\"text-align:left;\">200 ksps / 200,000 Hz at 5V or 75 ksps / 75,000 Hz at 2.7V</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">Raspberry Pi GPIO Voltage</td>\n<td style=\"text-align:left;\">3.3V max!! Otherwise, you could fry your pi.</td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">78L33 3.3V 100ma Voltage Regulator</td>\n<td style=\"text-align:left;\"><a href=\"https://pdf1.alldatasheet.com/datasheet-pdf/view/22689/STMICROELECTRONICS/L78L33C.html\" alt=\"datasheet\">Datasheet</a></td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">LD33V 3.3V 950ma Voltage Regulator</td>\n<td style=\"text-align:left;\"><a href=\"https://www.sparkfun.com/datasheets/Components/LD1117V33.pdf\" alt=\"datasheet\">Datasheet</a></td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">MCP1541 4.096V Voltage Reference</td>\n<td style=\"text-align:left;\"><a href=\"http://ww1.microchip.com/downloads/en/DeviceDoc/21653C.pdf\" alt=\"datasheet\">Datasheet</a></td>\n</tr>\n<tr>\n<td style=\"text-align:left;\">MCP6004 1.8V - 6.0V Op Amp</td>\n<td style=\"text-align:left;\"><a href=\"http://ww1.microchip.com/downloads/en/DeviceDoc/20001733K.pdf\" alt=\"datasheet\">Datasheet</a></td>\n</tr>\n</tbody>\n</table>\n<p>So why would I need an op amp and voltage reference? Well. Good question. And it's a good question because if your just learning how to use your MCP3008 chip from some of the other websites out there, they don't mention absolutely anything about using these components.</p>\n<p>However, if you are reading from an analog sensor, an op amp is almost absolutely nessesary. In addition, a voltage reference is a very value chip for the sole purpose of stabilizing your voltage going into the MCP3008. These two components greatly increase the accuracy of your sensor readings.</p>\n<p>But this tutorial is about reading the MCP3008 in Rust. So without further ado, let's get to that.</p>\n<p>If you are trying to see a tutorial for how to implement your own SPI protocol, I apologize, this is not that tutorial. I would recommend checking out the cargo crate below we will use for this tutorial.</p>\n<p><a href=\"https://crates.io/crates/spidev\" alt=\"link\">Cargo Crate: spidev</a></p>\n<p>As linux already has a built in SPI interface, this crate allows us to communicate with it to read from the MCP3008.</p>\n<p>So to start, let's look at the setup of the driver.</p>\n<pre><code class=\"rust language-rust\">let channel = 5; // 0 - 7\nlet write = [1, 8+channel &lt;&lt; 4, 0];\nlet mut read: [u8; 3] = [0; 3];\nlet mut transfer = SpidevTransfer::read_write(&amp;write, &amp;mut read);\n</code></pre>\n<p>Our initial write buffer is simple, First index is 1, last index is 0, and the second index is a bit mask. Let's look at the 1's and 0's</p>\n<pre><code class=\"rust language-rust\">let channel = 5; // 0 - 7\n\n// 8 + 5 = 13\n0000_1000 + 0000_0101 = 0000_1101\n\n// 13 &lt;&lt; 4 = 208\n0000_1101\n1101_0000\n\n// if channel = 0\n(8 + 0) &lt;&lt; 4 = 128\n1000_0000\n\n// if channel = 7\n(8 + 7) &lt;&lt; 4 = 240\n1111_0000\n</code></pre>\n<p>This write message will signify to the MCP3008 that we want to read from that specific channel. The read buffer is simply going to be what the MCP replies with.</p>\n<p>One final trick we have to worry about is activating the Chip Select pin to signal to the MCP that we are ready to read from it. According to the datasheet, the chip select can be any GPIO pin on the Raspberry Pi. We just have to manually set it low, read from the chip, then bring it back high when we are complete!</p>\n<pre><code class=\"rust language-rust\">self.cs.set_low();\nmatch self.spi.transfer(&amp;mut transfer) {\n    Ok(_) =&gt; (),\n    Err(_) =&gt; return Err(Errors::FailedRead)\n};\nself.cs.set_high();\n</code></pre>\n<p>Easy enough! Now, the final crucial part is the conversion of the MCP value to it's actual resolution. Value returned from the MCP will not be set correctly. Thankfully, this is a one liner.</p>\n<pre><code class=\"rust language-rust\">return Ok((((read[1] as u16) &lt;&lt; 8) | (read[2] as u16)) &amp; 1023);\n</code></pre>\n<p>Ignoring the first index of the read buffer, we grab the second number and convert it to a 16 bit unsigned integer. Whatever is originally was, the number now has twice as many bits. Then we shift all the values 8 bits over. Now, our number is shifted to the left side of the byte array. On the other side of the bitwise or operator, we do the same thing with the third index of the read buffer, but this time we apply the bitwise and operator to only keep the values in the first 10 bits of resolution. With these two values or'd together, we have our final output. Let's just look at the 1's and 0's in action.</p>\n<pre><code class=\"rust language-rust\">// This is an actualy reading from a capacitive soil sensor\nread[] = [0, 1, 229];\n\n// read[1] as u16\n0000_0001 -&gt; 0000_0000_0000_0001\n// &lt;&lt; 8\n0000_0000_0000_0001 -&gt; 0000_0001_0000_0000\n\n// read[2] as u16\n1110_0101 -&gt; 0000_0000_1110_0101\n// &amp; 1023\n0000_0000_1110_0101 &amp; 0000_0011_1111_1111 = 0000_0000_1110_0101\n\n256 | 229 = 485\n0000_0001_0000_0000 | 0000_0000_1110_0101 = 0000_0001_1110_0101\n</code></pre>\n<p>Hopefully you can visualize the bits moving around and taking form to get the final output! So, now you probably want to try it out for yourself. Follow the guidelines below to setup the Pi and MCP3008.</p>\n<h3 id=\"step1\">Step 1</h3>\n<p>Get a Raspberry Pi. It would be preferable to get a Raspberry Pi 3B or greater as it has a wifi chip.</p>\n<h3 id=\"step2\">Step 2</h3>\n<p>You will also need to get ahold of a MCP3008, a few hook up wires, breadboard, and a few capacitors if you'd like. This guide will only be a basic introduction to reading from the MCP3008, not a guide for a proper electrical design schematic.</p>\n<h3 id=\"step3\">Step 3</h3>\n<p>Install the Raspbian OS. It's fairly easy to do and there are plenty of resources out there to help you. In fact, your Pi probably already comes with a SD card with the OS preloaded.</p>\n<h3 id=\"step4\">Step 4</h3>\n<p>Enable SSH so you can remote in. If you'd prefer to not do that, plug in a keyboard, mouse and monitor!</p>\n<h3 id=\"step5\">Step 5</h3>\n<p>Enable SPI communication interface on the Pi. You can do this from the raspberry pi configuration settings or by typing into a terminal the following.</p>\n<pre><code class=\"shell language-shell\">sudo raspi-config\n</code></pre>\n<h3 id=\"step6\">Step 6</h3>\n<p>You'll probably need to reboot, but go ahead and shut the Pi off and use the MCP3008 datasheet to help you with the pins. Use the diagram below to help you to wire the MCP to the Pi.</p>\n<pre><code class=\"shell language-shell\">VDD ------- 3.3V\nVREF ------ 3.3V\nAGND ------ Ground\nCLK ------- BCM 11 (SCLK)\nDOUT ------ BCM 9 (MISO)\nDIN ------- BCM 10 (MOSI)\nCS/SHDN --- BCM 25\nDGND ------ Ground\n</code></pre>\n<h3 id=\"step7\">Step 7</h3>\n<p>Reboot the Pi and open a terminal and install Rust by typing the following.</p>\n<pre><code class=\"shell language-shell\">curl https://sh.rustup.rs -sSf | sh\n</code></pre>\n<p>The Rustup installer should give you a few dialog boxes. Go ahead a choose the obvious. The Rustup installer is pretty smart and automatically detects your current hardware configurations.</p>\n<h3 id=\"step8\">Step 8</h3>\n<p>Install git and clone the MCP3008 Rust driver repository. Type in the below.</p>\n<pre><code class=\"shell language-shell\">sudo apt-get install git -y &amp;&amp; git clone https://github.com/jackmead515/rust_mcp3008\n</code></pre>\n<h3 id=\"step9\">Step 9</h3>\n<p>Build the library, run it, and have fun!</p>\n<pre><code class=\"shell language-shell\">cd rust_mcp3008\ncargo build\nsudo ./target/debug/rust_mcp3008\n</code></pre>\n<p>Don't worry if you cannot figure out how to setup the circuit or don't know what sensor to plug into the MCP. I didn't want to go to in depth in this tutorial as I will be releasing another blog with all of those details very clearly. Sorry if this has been an annoyance. Check out the link below for that blog! Let me know if you have any questions in the comments below!</p>\n<p><a href=\"https://www.speblog.org/blog/mcp3008-analog-digital-electronic-circuit-raspberry-pi\" alt=\"link\">\n    MCP3008 Circuit Design Blog\n</a></p>"
}