{
  "head": {
    "title": "Pulse Solar Charge Circuit",
    "subtitle": "Custom hysteresis comparator circuit for a solar charge controller.",
    "date": 1579459102,
    "link": "solar-charge-controller-opamp-comparator-circuit",
    "description": "This custom circuit makes for an entertaining 12V solar cell charge controller operating at extremely low currents. Learn how to build this circuit and learn about hysteresis with op-amps and comparators.",
    "image": "image/generic/solar.jpg",
    "tags": [
      "raspberry", "pi", "arduino", "sensor", "electronics", "circuits", "solar", "opamp", "transistor", "capacitor", "regulator"
    ]
  },
  "contents": [
    {
      "type": "p",
      "contents": "Disclaimer: I built this circuit out of a random idea. Therefore, it's not a super professional design. That being said, I attempted to design it so that any low powered 12V solar cell can be put on it and work! And, it really does work."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "The basic circuit is composed of a <b>Non-Inverting Op-Amp Comparator with Hysteresis</b>."
    },
    {
      "type": "image",
      "props": {
        "zoomable": true,
        "source": "image/solar_circuit.jpg"
      }
    },
    {
      "type": "p",
      "contents": "The list of components isn't too complicated. Additionally, I would exchange these components out for different one's if I had them. For instance, there is no need to have an MCP6004 op-amp. I could use a single comparator chip. But, this is the only thing I had on hand!"
    },
    {
      "type": "table",
      "props": {
        "headings": [
          "Amount",
          "Component",
          "Datasheet"
        ]
      },
      "contents": [
        "1",
        "MCP6004 Op Amp",
        {
          "type": "a",
          "props": {
            "target": "tab",
            "href": "http://ww1.microchip.com/downloads/en/DeviceDoc/20001733K.pdf"
          },
          "contents": "Datasheet"
        },
        "1",
        "LM1084IT 5V Regulator",
        {
          "type": "a",
          "props": {
            "href": "https://www.jameco.com/Jameco/Products/ProdDS/299743-DS01.pdf",
            "target": "tab"
          },
          "contents": "Datasheet"
        },
        "1",
        "LD33V 3.3V Regulator",
        {
          "type": "a",
          "props": {
            "href": "https://www.sparkfun.com/datasheets/Components/LD1117V33.pdf",
            "target": "tab"
          },
          "contents": "Datasheet"
        },
        "1",
        "1N4001 Diode",
        {
          "type": "a",
          "props": {
            "href": "https://www.diodes.com/assets/Datasheets/ds28002.pdf",
            "target": "tab"
          },
          "contents": "Datasheet"
        },
        "1",
        "2n2222a Transistor",
        {
          "type": "a",
          "props": {
            "href": "http://web.mit.edu/6.101/www/reference/2N2222A.pdf",
            "target": "tab"
          },
          "contents": "Datasheet"
        },
        "2",
        "6V Solar Cells in Series",
        "N/A",
        "1",
        "9V Battery with clip",
        "N/A",
        "1",
        "2200 uF electrolytic capacitor",
        "N/A",
        "2",
        "1 uF ceramic capacitor",
        "N/A",
        "3",
        "0.1 uF ceramic capacitor",
        "N/A",
        "7",
        "Resistors: 1M x2, 300k x2, 1k x1, 220k x1, 100k x1",
        "N/A"
      ]
    },
    {
      "type": "p",
      "contents": "Designing this circuit was difficult. It was the first circuit in which I had to worry about how much current I was using, and, the instability of a 9V battery. To make the comparator work, I had to have a high enough voltage to make the equations equal out. But, if I expect this circuit to last a long time, the battery has to only supply as little current as necessary."
    },
    {
      "type": "p",
      "contents": "Here is a full schematic of the design."
    },
    {
      "type": "image",
      "props": {
        "zoomable": true,
        "source": "image/solar_circuit_schematic.png"
      }
    },
    {
      "type": "p",
      "contents": "So, how does this circuit work? The basic circuit is an op-amp configured as a comparator. A comparators job is to switch on and off depending on a reference voltage and input voltage."
    },
    {
      "type": "p",
      "contents": "In this design, the solar panel is the input voltage, and a 5V regulated voltage from the battery is the reference. As the solar cells charge the 2200uf capacitor, the voltage on the input will rise. Once it is above the reference voltage, the output of the op=amp will switch on, triggering the 2n2222a transistor, and activating the LD33V 3.3V regulator to power the load. However, with a few resistors thrown in, we can manipulate the trigger voltage to activate and deactivate at different values. This is where the hysteresis comes to play."
    },
    {
      "type": "p",
      "contents": "In a normal comparator, the op-amp would trigger at 5V. But, we have a voltage divider at the input of the solar cell with feedback from the output. This will change what triggers the op-amp. Let's look at a diagram to get a better understanding."
    },
    {
      "type": "image",
      "props": {
        "zoomable": true,
        "source": "image/comparator-hysteresis.jpg"
      }
    },
    {
      "type": "p",
      "contents": "Super cool. It's like magic. When the solar voltage rises above V1, the op-amp will trigger it's output. But, it will not trigger back to zero until the voltage goes below V2!! All we have to do is discover what R1 and R2 resistances are so we can know what V1 and V2 are (or vise versa)."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "The equations for that are given by <b>R1 / R2 = (V1 - V2) / VC</b> and <b>VREF = V1 / (1 + R1/R2)</b>. VC in this case is 5V and we want to make VREF to 5V as well."
    },
    {
      "type": "p",
      "contents": "Now, as usual, I didn't like doing the math. But in this case, these equations are simple and I got really close to the output I wanted when I solved the equations. What I want is for V1 and V2 to be inside a safe range to always be triggering the 3.3V regulator while the op-amp is activated. I know that the dropout voltage for the LD33V is ~1V. So, a minimum of 4.3V for V2 is what we need. Next, I pick an arbitrary 7V for V1 as I want to make sure that the range between V1 and V2 is large enough so the op-amp will stay triggered for a while and ensure the circuit still operates in low light. It's a great test at the time of building this circuit as we just had a blizzard in Iowa and it's very cloudy out."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "Alright. So, plugging in our values for our first equation we get: <b>R1 / R2 = (7 - 4.3) / 5 = 0.54</b>. This equals to <b>R1 = R2 * 0.54</b> That means that R1 is about half of R2! Wicked!"
    },
    {
      "type": "p",
      "contents": "So, I'm going to pick 1M for R2. That would leave R1 at 540K Ohms. Well crap. That's not a nice pretty resistance value. But I do have a 300K and 220K resistor that equals out to 520K Ohms. Close enough right? Well let's test it out by hooking it up to the oscilloscope and see what happens!"
    },
    {
      "type": "image",
      "props": {
        "zoomable": true,
        "source": "image/solar-oscilloscope.jpg"
      }
    },
    {
      "type": "p",
      "contents": "I managed to capture it at the exact moment that the op-amp had triggered. You can see the camera captured two lines as it was going back down! So that would be our V1 at ~7.3V. Not bad! At while I won't post a picture to show it, the voltage dropped back down too roughly ~3.84V. Again, not bad! I should note that there will be a 0.7V drop acrossed the 2n2222a transistor, so the final ouput voltage before the op-amp triggers off will be ~3.14V. This is definitely not enough to drive the LD33V, but, my design seems to work none the less."
    },
    {
      "type": "p",
      "contents": "Honestly, we are done. But, there are a few more things I want to point out in the design of this circuit. There is a 1M pull down resistor at the voltage reference, a 300K pull down resistor at the power supply of the op-amp, and a 100K resistor in series with the 2n2222a transistor. Why did I do this?"
    },
    {
      "type": "p",
      "contents": "Well resistors are current limiting devices. They are going to limit the amount of current that will go into the circuit. And that was what I wanted to accomplish. I wanted to make sure the op-amp only gets what it needs to drive the circuit. Using a voltage divider tool online, I found that a 1M pull down resistor at VREF will limit the current too 5uA. A 300K pull down to the power supply will limit the current too 30ua. According to the datasheet, a MCP6004 needs typically 100ua to drive, but, I suspect that since I'm only using 1 of the op-amps, it doesn't need nearly that much. Finally, I just played around with the resistance at the 2n2222a transistor. 100K seemed to just be able to trigger it."
    },
    {
      "type": "p",
      "contents": "Okay I'm done. I plan on improving this design by switching out the op-amp with a smaller comparator, swapping the 5V regulator with a lighter one, switching the 2n2222a trigger transistor with a bigger one to handle more current from a larger solar cell, and messing with the resistance just a little more. Currently, it looks like one of my 9V batteries only lasted 3 days before it crapped out! So, perhaps something isn't quite right. In the meantime, thank you so much!"
    },
    {
      "type": "p",
      "contents": "If you have comments or suggestions for design choices I should make, comment below!"
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "<b>Edit: Same day</b>"
    },
    {
      "type": "p",
      "contents": "Well I made a couple of little adapters to hook up to my volt meter to test how much current my circuit draws. It draws 8mA! Which, I didn't think was that bad until I looked up a datasheet for a 9v battery."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "So, this specific 9V battery said it gets around 500mAh. If we do some manipulation, <b>500mAh / 1000 = 0.5 Ah</b> then <b>8mA / 1000 = 0.008A</b> finally we get <b>0.5 / 0.008A = 62.5 hours</b>. The stupid battery won't even power my circuit for 3 days! Pathetic."
    },
    {
      "type": "p",
      "props": {
        "embed": true
      },
      "contents": "Additionally, I measured the output of the solar cells and got <b>1mA</b>!!! So I am defintely not putting enough energy into the system to make it worth while and I absolutely need to optimize my circuit. For right now the circuit would work best if it was hooked up to a wall outlet and a much larger panel was hooked up. I will be looking into this matter... Stay tuned..."
    }
  ]
}