{
  "head": {
    "title": "TV Remote Controlled Robots",
    "subtitle": "Robots from TV electronics and pizza boxes",
    "date": 1570813200,
    "link": "tv-remote-robots",
    "image": "image/tvremoterobots.jpg",
    "description": "Explore how with just a few lines of code and some basic electronic knowledge you can create your own remote controlled robot!",
    "tags": [
      "raspberry", "pi", "arduino", "c", "c++", "electronics", "programming"
    ]
  },
  "contents": [
    {
      "type": "mini",
      "props": {
        "title": "Robots"
      },
      "contents": [
        {
          "type": "image",
          "props": {
            "source": "image/tvremoterobots.jpg"
          }
        }
      ]
    },
    {
      "type": "a",
      "props": {
        "target": "tab",
        "href": "https://github.com/jackmead515/ir_robot"
      },
      "contents": "Github Repo"
    },
    {
      "type": "p",
      "contents": "This was a project I did for a STEM festival while I was in college. I was with a team of people but, it seemed, I was the only one able to and willing to take the leadership position."
    },
    {
      "type": "p",
      "contents": "You have to understand. I was VERY poor. So, imagine a young and poor engineering college student looking around his apartment of old pizza boxes, rusted Arduinos, and scraps of wood. The only logical thing was to use what I had to build something fun."
    },
    {
      "type": "p",
      "contents": "The first step was to gather the supplies I needed. Because the robots really wouldn't be robots without a base, microcontroller, and a battery. Thankfully, the STEM festival allowed a certain amount of money to be refunded for purchases."
    },
    {
      "type": "p",
      "contents": "3 Ardunino Unos from China -> $15."
    },
    {
      "type": "p",
      "contents": "3 6v RC Batteries -> $45"
    },
    {
      "type": "p",
      "contents": "2 sheets of plywood -> $10"
    },
    {
      "type": "p",
      "contents": "6 Continous Servo Motors -> $90"
    },
    {
      "type": "p",
      "contents": "Now, that was essentially the limit of our spending. So I had to get creative."
    },
    {
      "type": "p",
      "contents": "I needed wheels. Wheels that could attach to the servo motors and had enouch traction to roll acrossed a gym floor."
    },
    {
      "type": "p",
      "contents": "So I had some old pizza boxes laying around that would serve as the center, old plastic strap that would wrap around the wheel for a smooth surface, and half used sandpaper to serve as the traction. And, of course, it was all secured down with hot glue and zip ties."
    },
    {
      "type": "p",
      "contents": "Next, I needed IR sensors and remote controllers to control them. By the grace of science, someone from across my apartment complex had thrown out 2 CRT monitor TV's with there remotes."
    },
    {
      "type": "p",
      "contents": "Now, if anyone else out there has tried to open a CRT monitor they would now that it's DAMN hard. But oh boy is there a treasure trove of trinkets and gizmos in there. People have even turned one into a makeshift oscilloscope!"
    }
  ]
}